package Inheritance.TwoDShape_1.ABC_1;

// Создать подкласс путём расширения класса А
public class B extends A {
    B() {
        System.out.println("Конструктор B");
    }
}
