package Inheritance.TwoDShape_1.ABC_1;

// Создать класс путём расширения класса B
public class C extends B {
    C() {
        System.out.println("Конструктор C");
    }
}
